source = input()
p=open(source, 'r')
s=p.read()
data = s
alphavit = [("А", "F"), ("К", "R"), ("Л", "K"), ("С", "C"), ("Ч", "X"), ("а", "f"),
             ("Б", "<"), ("Й", "Q"), ("М", "V"), ("Т", "N"), ("Э", "/"), ("б", "<"),
             ("В", "D"), ("И", "B"), ("Н", "Y"), ("У", "E"), ("Ю", ">"), ("в", "b"),
             ("Г", "U"), ("З", "P"), ("О", "J"), ("Ф", "A"), ("Я", "Z"), ("г", "u"),
             ("Д", "L"), ("Ж", ":"), ("П", "G"), ("Х", "["), ("Ь", "M"), ("д", "l"),
             ("Е", "T"), ("Ё", "~"), ("Р", "H"), ("Ц", "W"), ("Ъ", "]"), (" "," "),
             ("е", "t"), ("ё", "+"), ("ж", ";"), ("з", "p"), ("и", "b"), ("к","r"),
             ("л", "k"), ("м", "v"), ("н", "y"), ("о", "j"), ("п", "g"), ("р","h"),
             ("с", "c"), ("т", "n"), ("у", "e"), ("ф", "a"), ("х", "{"), ("ц","w"),
             ("я", "z"), ("ю", "."), ("э", "*"), ("ъ", "}"), ("ь", "m"), ("ч","x"),]
 
lester =data.translate(str.maketrans(dict(alphavit)))
print(data.translate(str.maketrans(dict(alphavit))))

p.close

f = open (source,'w')

f.close

d = open (source,'a')
d.write(lester)
d.close